import ContactDetails from "./ContactDetails"

const ContactList = () => {

  const contactData = [
    {
      title: "เบอร์โทรศัพท์",
      details: [
        {
          label: "ผู้อำนวยการสำนักสาธารณสุขและสิ่งแวดล้อม",
          numbers: ["02-5890500 ต่อ 1220"],
          subDetails: [
            {
              label: "ฝ่ายบริหารงานทั่วไป",
              numbers: [],
              subDetails: [
                {
                  label: "งานบริหารทั่วไป",
                  numbers: ["02-5890500 ต่อ 1223"],
                },
                {
                  label: "งานการเงินและบัญชี",
                  numbers: ["02-5890500 ต่อ 1225"],
                },
              ],
            },
          ],
        },
        {
          label: "ผู้อำนวยการส่วนส่งเสริมสาธารณสุข",
          numbers: [],
          subDetails: [
            {
              label: "ฝ่ายวิชาการและการประเมินผล",
              numbers: [],
              subDetails: [
                {
                  label: "งานนโยบายและแผนงานสาธารณสุข",
                  numbers: ["02-5890500 ต่อ 1218"],
                },
                {
                  label: "งานวิชาการและบริการข้อมูล",
                  numbers: ["02-5890500 ต่อ 1218"],
                },
                {
                  label: "งานติดตามและประเมินผล",
                  numbers: ["02-5890500 ต่อ 1218"],
                },
              ],
            },
            {
              label: "ฝ่ายส่งเสริมสาธารณสุข",
              numbers: [],
              subDetails: [
                {
                  label: "งานหลักประกันสุขภาพ",
                  numbers: ["02-5890500 ต่อ 1214"],
                },
                {
                  label: "งานส่งเสริมคุณภาพชีวิตผู้สูงอายุ",
                  numbers: ["02-5897714 - 6"],
                },
                {
                  label: "งานอาสาสมัครสาธารณสุข",
                  numbers: ["02-5897714 - 6"],
                },
                {
                  label: "งานเผยแพร่และฝึกอบรมด้านสาธารณสุข",
                  numbers: ["02-5897714 - 6"],
                },
                {
                  label: "งานสัตวแพทย์",
                  numbers: ["02-5800866"],
                },
                {
                  label: "งานส่งเสริมสุขภาพ",
                  numbers: ["02-5897714 - 6"],
                },
                {
                  label: "งานป้องกันและควบคุมโรค",
                  numbers: ["02-5890500 ต่อ 1209"],
                },
              ],
            },
          ],
        },
        {
          label: "ผู้อำนวยการส่วนบริการอนามัยสิ่งแวดล้อม",
          numbers: [],
          subDetails: [
            {
              label: "ฝ่ายจัดการมูลฝอยและสิ่งปฏิกูล",
              numbers: [],
              subDetails: [
                {
                  label: "งานบริการรักษาความสะอาด",
                  numbers: ["02-5890500 ต่อ 1202"],
                },
                {
                  label: "งานบริหารจัดการมูลฝอย",
                  numbers: ["02-5890500 ต่อ 1202"],
                },
                {
                  label: "งานพัฒนาระบบจัดการมูลฝอย",
                  numbers: ["02-5890500 ต่อ 1202"],
                },
                {
                  label: "งานบริหารจัดการสิ่งปฏิกูล",
                  numbers: ["02-5890500 ต่อ 1203"],
                },
              ],
            },
          ],
        },
        {
          label: "ผู้อำนวยการส่วนส่งเสริมอนามัยสิ่งแวดล้อม",
          numbers: ["02-5890500 ต่อ 1212"],
          subDetails: [
            {
              label: "ฝ่ายควบคุมและจัดการคุณภาพสิ่งแวดล้อม",
              numbers: [],
              subDetails: [
                {
                  label: "งานสุขาภิบาลสถานประกอบการ",
                  numbers: ["02-5890500 ต่อ 1207"],
                },
                {
                  label: "งานสุขาภิบาลชุมชนเมืองและเหตุรำคาญ",
                  numbers: ["02-5890500 ต่อ 1207"],
                },
                {
                  label: "งานคุ้มครองผู้บริโภค",
                  numbers: ["02-5890500 ต่อ 1207"],
                },
                {
                  label: "งานเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม",
                  numbers: ["02-5890500 ต่อ 1210"],
                },
                {
                  label: "งานจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                  numbers: ["02-5890500 ต่อ 1210"],
                },
              ],
            },
          ],
        },
      ],
    }
  ]

  return (
    <ul className="menu bg-base-200 rounded-box max-w-3xl w-full self-center">
        {contactData.map((category, index) => (
        <li key={index}>
          <ContactDetails title={category.title} details={category.details} />
        </li>
      ))}
    </ul>
  )
}

export default ContactList