import Breadcrumbs from "@/components/Breadcrumbs"
import Divider from "@/components/Divider";
import GenericList from "@/components/GenericList";

const EnvironmentalHealthPromotionSection = () => {

    const envQualityDept = {
        title: "1. ฝ่ายควบคุมและจัดการคุณภาพสิ่งแวดล้อม",
        content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานสุขาภิบาลสถานประกอบการ งานสุขาภิบาลชุมชนเมืองและเหตุรำคาญ งานคุ้มครองผู้บริโภค งานเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม และงานจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม ดังนี้",
        items: [
            {
                title: "1.1 งานสุขาภิบาลสถานประกอบการ",
                content: null,
                subItems: [
                    { content: "วางแผนจัดทำแผนปฏิบัติการด้านสุขาภิบาลอาหารและน้ำในสถานประกอบการ จำหน่ายอาหาร ร้านอาหาร หาบเร่ แผงลอย ตลาดสด แหล่งผลิตอาหาร และสถานบริการ" },
                    { content: "การติดตาม ตรวจสอบและควบคุมการอนุญาตในสถานที่จำหน่ายหรือสะสมอาหาร และเครื่องดื่ม" },
                    { content: "การพัฒนาและปรับปรุงยกระดับมาตรฐานการสุขาภิบาลในสถานประกอบการ ร้านจำหน่ายอาหาร หาบเร่-แผงลอย ตลาดสด ร้านอาหารในโรงเรียน" },
                    { content: "งานฝึกอบรมและเผยแพร่ประชาสัมพันธ์งานสุขาภิบาล" },
                    { content: "การจัดทำพัฒนาระบบฐานข้อมูลงานสุขาภิบาลประกอบการค้า" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.2 งานสุขาภิบาลชุมชนเมืองและเหตุรำคาญ",
                content: null,
                subItems: [
                    { content: "การวางแผน การจัดทำ การตรวจสอบ ปรับปรุงแก้ไข ยกระดับมาตรฐานด้านสุขาภิบาลทั่วไปสำหรับสถานบริการ โรงงาน ชุมชนและกิจการที่เป็นอันตราย ต่อสุขภาพ การติดตาม ตรวจสอบ กิจการที่เป็นอันตรายต่อสุขภาพ" },
                    { content: "งานอาชีวอนามัยและความปลอดภัยในสถานประกอบการ" },
                    { content: "การวางแผนและควบคุมการดำเนินงานด้านสุสานและฌาปนสถาน" },
                    { content: "การรับเรื่องราว ร้องทุกข์และติดตาม ตรวจสอบ และแก้ไขเหตุเดือดร้อนรำคาญ" },
                    { content: "การวางแผน การควบคุม ป้องกันการร้องทุกข์เกี่ยวกับเหตุเดือดร้อนรำคาญ" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.3 งานคุ้มครองผู้บริโภค",
                content: null,
                subItems: [
                    { content: "การวางแผน การจัดทำแผนปฏิบัติการคุ้มครองผู้บริโภค ด้านน้ำ อาหาร ยารักษาโรค และเครื่องสำอาง" },
                    { content: "การส่งเสริมประชาสัมพันธ์ให้ประชาชน องค์กร มีความตระหนักในการบริโภคน้ำ อาหาร การใช้ยารักษาโรค และเครื่องสำอางที่ปลอดภัย" },
                    { content: "การคุ้มครองและปกป้องสิทธิผู้บริโภค" },
                    { content: "งานวิเคราะห์ ตรวจสอบคุณภาพ เฝ้าระวัง อาหารและเครื่องดื่ม" },
                    { content: "ควบคุมการจำหน่ายยารักษาโรคและเครื่องสำอาง" },
                    { content: "การรับเรื่องราวร้องทุกข์ ประสานการแก้ไข การประสานความร่วมมือกับภาคีต่าง ๆ และประชาชนในการดำเนินงานคุ้มครองผู้บริโภค" },
                    { content: "จัดทำและพัฒนาระบบฐานข้อมูลคุ้มครองผู้บริโภค" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.4 งานเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม",
                content: null,
                subItems: [
                    { content: "วางแผน จัดทำแผนปฏิบัติการเฝ้าระวัง และควบคุมมลพิษทางน้ำ อากาศ และเสียง ตรวจสอบ ควบคุม และดำเนินการแก้ไขแหล่งกำเนิดมลพิษต่าง ๆ" },
                    { content: "ดำเนินงานตรวจสอบและแก้ไขเรื่องร้องเรียนร้องทุกข์ด้านมลพิษต่าง ๆ" },
                    { content: "ดำเนินงานตามภารกิจถ่ายโอน การตรวจสอบและออกใบอนุญาตสถานีบริการ น้ำมันเชื้อเพลิง และสถานประกอบการต่าง ๆ" },
                    { content: "การประสานกับเครือข่ายในการเฝ้าระวัง และควบคุมมลพิษจากสถานประกอบการต่าง ๆ" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.5 งานจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                content: null,
                subItems: [
                    { content: "วางแผน จัดทำ พัฒนาแผนยุทธศาสตร์ แผนปฏิบัติการจัดการคุณภาพสิ่งแวดล้อม และการจัดการทรัพยากรธรรมชาติ " },
                    { content: "รวบรวมข้อมูล วิเคราะห์ จัดทำรายงานสถานการณ์ด้านสิ่งแวดล้อม และสถานการณ์ด้านการจัดการทรัพยากรธรรมชาติ" },
                    { content: "จัดทำและพัฒนาระบบฐานข้อมูลด้านการจัดการสิ่งแวดล้อมและการจัดการทรัพยากรธรรมชาติ" },
                    { content: "พัฒนาความร่วมมือ รณรงค์สร้างจิตสำนึก ฝึกอบรม และส่งเสริมการมีส่วนร่วมของประชาชนในการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
        ],
    };

    const breadcrumbs = [
        { label: "หน้าแรก", href: "/" },
        { label: "หน่วยงานภายใน", href: "/departments/general" },
        { label: "ส่วนส่งเสริมอนามัยสิ่งแวดล้อม", isCurrent: true },
    ];

    return (
        <>
            <Breadcrumbs items={breadcrumbs} />
            <div className="my-3">
                <h1 className="text-2xl sm:text-3xl font-bold">ส่วนส่งเสริมอนามัยสิ่งแวดล้อม</h1>
                <Divider />
                <p>มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของฝ่ายควบคุมและจัดการคุณภาพสิ่งแวดล้อม ดังนี้</p>
            </div>
            <GenericList {...envQualityDept} />
        </>
    )
}

export default EnvironmentalHealthPromotionSection