import Breadcrumbs from "@/components/Breadcrumbs"
import Divider from "@/components/Divider";
import GenericList from "@/components/GenericList";

const PublicHealthPromotionSection = () => {

    const breadcrumbs = [
        { label: "หน้าแรก", href: "/" },
        { label: "หน่วยงานภายใน", href: "/departments/general" },
        { label: "ส่วนส่งเสริมสาธารณสุข", isCurrent: true },
    ];

    const academicEvaluationDepartment = {
        title: "1. ฝ่ายวิชาการและการประเมินผล",
        content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแล และอำนวยการดำเนินงานของ งานนโยบายและแผนงานสาธารณสุข งานวิชาการ และบริการข้อมูลงานติดตามและประเมินผล ดังนี้",
        items: [
            {
                title: "1.1 งานนโยบายและแผนงานสาธารณสุข ",
                content: null,
                subItems: [
                    { content: "จัดทำแผนงานด้านสาธารณสุขและสิ่งแวดล้อม แผนยุทธศาสตร์การพัฒนา แผนพัฒนาท้องถิ่น แผนดำเนินงานประจำปี" },
                    { content: "แผนการจัดหาบุคลากร กรอบอัตรากำลัง" },
                    { content: "จัดทำและประสานแผนดำเนินกิจกรรม/ โครงการของส่วนราชการต่าง ๆ ในรูปแบบแผนงานหลักของสำนักสาธารณสุขและสิ่งแวดล้อม" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.2 งานวิชาการและบริการข้อมูล",
                content: null,
                subItems: [
                    { content: "การปฏิบัติงานด้านสารบรรณและธุรการทั่วไป" },
                    { content: "งานบริการข้อมูล สถิติ และวิชาการต่าง ๆ ด้านสาธารณสุขและสิ่งแวดล้อม" },
                    { content: "พัฒนาระบบฐานข้อมูลสารสนเทศให้เป็นปัจจุบันอย่างต่อเนื่อง" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "1.3 งานติดตามและประเมินผล",
                content: null,
                subItems: [
                    { content: "ติดตามและประเมินผลโครงการด้านสาธารณสุขและสิ่งแวดล้อม" },
                    { content: "ติดตามและประเมินผลแผนพัฒนาท้องถิ่น แผนการดำเนินงานประจำปีงบประมาณและแผนต่าง ๆ ที่เกี่ยวข้องกับภารกิจของสำนัก อาทิ แผนป้องกันการทุจริตแผนบริหารความเสี่ยง เป็นต้น" },
                    { content: "ประสานงาน ประเมินผลการปฏิบัติงานตามภารกิจด้านสาธารณสุขและสิ่งแวดล้อมตามตัวชี้วัดการประเมินผลที่เกี่ยวข้อง อาทิ การประเมินผลการปฏิบัติราชการตามคำรับรองการปฏิบัติราชการประจำปี การประเมินประสิทธิภาพการปฏิบัติราชการขององค์กรปกครองส่วนท้องถิ่น การประเมินผู้บริหารท้องถิ่น การประเมินประสิทธิภาพและประสิทธิผลการปฏิบัติราชการเพื่อเสนอขอรับเงินรางวัลประจำปี การประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ เป็นต้น" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
        ],
    };

    const publicHealthPromotionDepartment = {
        title: "2. ฝ่ายส่งเสริมสาธารณสุข",
        content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานหลักประกันสุขภาพ งานส่งเสริมคุณภาพชีวิตผู้สูงอายุ งานอาสาสมัครสาธารณสุข และงานเผยแพร่และฝึกอบรมด้านสาธารณสุข ดังนี้",
        items: [
            {
                title: "2.1 งานหลักประกันสุขภาพ",
                content: null,
                subItems: [
                    { content: "การดำเนินงานและบริหารจัดการระบบหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ โดยให้มีกองทุนหลักประกันสุขภาพที่มีวัตถุประสงค์เพื่อสนับสนุนและส่งเสริม การจัดบริการสาธารณสุขของหน่วยบริการ สถานบริการหน่วยงาน สาธารณสุข หน่วยงานอื่น องค์กรหรือกลุ่มประชาชน" },
                    { content: "ดำเนินงานบริการสาธารณสุขสำหรับผู้สูงอายุที่มีภาวะพึ่งพิงและบุคคลอื่นที่มีภาวะพึ่งพิง" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.2 งานส่งเสริมคุณภาพชีวิตผู้สูงอายุ",
                content: null,
                subItems: [
                    { content: "วางแผน สนับสนุนการพัฒนาคุณภาพชีวิตผู้สูงอายุ" },
                    { content: "การให้บริการและดำเนินการด้านการส่งเสริมคุณภาพชีวิตผู้สูงอายุ" },
                    { content: "กำกับดูแลศูนย์พัฒนาคุณภาพชีวิตผู้สูงอายุ เทศบาลนครนนทบุรี และศูนย์สาขา" },
                    { content: "วิเคราะห์ วิจัย หรือจัดทำแผนด้านการส่งเสริมคุณภาพชีวิตผู้สูงอายุในพื้นที่" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.3 งานอาสาสมัครสาธารณสุข",
                content: null,
                subItems: [
                    { content: "วางแผน ส่งเสริม พัฒนารูปแบบและดำเนินงานสาธารณสุขมูลฐาน" },
                    { content: "พัฒนาศักยภาพ นิเทศ ติดตาม ส่งเสริม และสนับสนุนการมีส่วนร่วมของอาสาสมัครสาธารณสุข องค์กรภาคประชาชน และประชาชนในการดูแลสุขภาพด้วยตนเอง" },
                    { content: "ถ่ายทอดความรู้และเทคโนโลยีที่เกี่ยวข้องกับสาธารณสุขมูลฐานและความรู้ด้านสุขภาพ" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.4 งานเผยแพร่และฝึกอบรมด้านสาธารณสุข",
                content: null,
                subItems: [
                    { content: "จัดทำแผนการเผยแพร่และฝึกอบรมให้สอดคล้องกับนโยบายสุขภาพทุกระดับทั้งระดับประเทศ ระดับจังหวัด ระดับพื้นที่ สภาพปัญหา ความเร่งด่วน และความต้องการของประชาชนในพื้นที่" },
                    { content: "ดำเนินโครงการที่เกี่ยวข้องด้านสาธารณสุข ครอบคลุมประชากรทุกกลุ่มเป้าหมาย เช่น วัยเด็ก วัยเรียน วัยทำงาน วัยผู้สูงอายุ สตรี ผู้พิการ ผู้ด้อยโอกาส เป็นต้น ในลักษณะโครงการภาพรวมในพื้นที่" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.5 งานสัตวแพทย์",
                content: null,
                subItems: [
                    { content: "จัดบริการทางด้านสัตวแพทย์ เช่น ตรวจรักษาโรค ทำหมัน ฉีดยาคุมกำเนิด ฉีดวัคซีนป้องกันโรคพิษสุนัขบ้า ฯลฯ ให้แก่สัตว์เลี้ยงในคลินิกสัตวแพทย์ เทศบาลนครนนทบุรี" },
                    { content: "ส่งเสริมการเลี้ยงสัตว์ให้ถูกวิธี บริการตรวจสุขภาพและให้คำปรึกษาด้านสุขภาพสัตว์" },
                    { content: "งานควบคุมโรคสัตว์สู่คน เฝ้าระวังควบคุมแหล่งเกิดโรค" },
                    { content: "รับเรื่องราว ตรวจสอบและแก้ไขปัญหาเรื่องร้องเรียนร้องทุกข์ที่เกี่ยวกับสัตว์ในพื้นที่สาธารณะ" },
                    { content: "ควบคุมการฆ่าสัตว์และจำหน่ายเนื้อสัตว์ให้เป็นไปตามกฎหมายว่าด้วยการควบคุม และจำหน่ายเนื้อสัตว์" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.6 งานส่งเสริมสุขภาพ",
                content: null,
                subItems: [
                    { content: "วางแผนและดำเนินการด้านส่งเสริมสุขภาพทุกกลุ่มวัย" },
                    { content: "งานโภชนาการ" },
                    { content: "งานอนามัยชุมชน งานวางแผนครอบครัว ให้สุขศึกษา" },
                    { content: "วางแผนและพัฒนาพฤติกรรมสุขภาพจิตของประชาชน" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
            {
                title: "2.7 งานป้องกันและควบคุมโรค",
                content: null,
                subItems: [
                    { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและควบคุมโรคติดต่อ โรคอุบัติใหม่" },
                    { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและควบคุมโรคไม่ติดต่อ" },
                    { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและบำบัดการติดสารเสพติด" },
                    { content: "วางแผนและดำเนินงานอนามัยโรงเรียน" },
                    { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
                ],
            },
        ],
    };

    return (
        <>
            <Breadcrumbs items={breadcrumbs} />
            <div className="my-3">
                <h1 className="text-2xl sm:text-3xl font-bold">ส่วนส่งเสริมสาธารณสุข</h1>
                <Divider />
                <p>มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแลและอำนวยการดำเนินงานของฝ่ายวิชาการและการประเมินผล ฝ่ายส่งเสริมสาธารณสุข ดังนี้</p>
            </div>
            <GenericList {...academicEvaluationDepartment} />
            <GenericList {...publicHealthPromotionDepartment} />
        </>
    )
}

export default PublicHealthPromotionSection