const Description = () => {
    return (
      <p>
        สำนักสาธารณสุขและสิ่งแวดล้อม เทศบาลนครนนทบุรี มีหน้าที่ความรับผิดชอบเกี่ยวกับงานการศึกษา ค้นคว้า วิจัย วิเคราะห์และจัดทำแผนงานด้านสาธารณสุข
        งานส่งเสริมสุขภาพ งานป้องกันเฝ้าระวังและควบคุมโรคติดต่อและโรคไม่ติดต่อ งานสุขาภิบาลในสถานประกอบการ งานสุขาภิบาลชุมชน งานคุ้มครองผู้บริโภค
        งานให้บริการด้านสาธารณสุข งานเภสัชกรรม งานพยาธิวิทยา งานรังสีวิทยา งานวิชาการทางการแพทย์ งานวิเคราะห์ทางวิทยาศาสตร์ งานการแพทย์
        งานการแพทย์ฉุกเฉิน งานรักษาพยาบาล งานศูนย์บริการสาธารณสุข งานโรงพยาบาลส่งเสริมสุขภาพตำบล งานบริหารสาธารณสุข งานส่งเสริมป้องกันควบคุมโรค
        งานเวชปฏิบัติครอบครัว งานหลักประกันสุขภาพ งานมาตรฐานและคุณภาพหน่วยบริการ งานยุทธศาสตร์สาธารณสุข งานกฎหมายสาธารณสุข งานแพทย์แผนไทย
        งานส่งเสริมสนับสนุนการแพทย์แผนไทย งานกายภาพและอาชีวบำบัด งานฟื้นฟูสมรรถภาพและจิตใจผู้ป่วย งานทันตสาธารณสุข งานบริการรักษาความสะอาด
        งานบริการและพัฒนาระบบจัดการมูลฝอย งานบริหารจัดการสิ่งปฏิกูล งานส่งเสริมสนับสนุนการพัฒนาคุณภาพชีวิตเด็ก สตรี ผู้สูงอายุ ผู้พิการ และผู้ด้อยโอกาสงานอาสาสมัครสาธารณสุข
        งานป้องกันและบำบัดการติดสารเสพติด งานสัตวแพทย์ งานศึกษาค้นคว้า วิเคราะห์ วิจัย วิเคราะห์กำหนดมาตรการและแผนดำเนินงานด้านสิ่งแวดล้อม การประเมินผลกระทบด้านสิ่งแวดล้อม
        การเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม งานส่งเสริมสนับสนุนด้านสิ่งแวดล้อมงานจัดทำและพัฒนาระบบฐานข้อมูลด้านการจัดการสิ่งแวดล้อม งานรณรงค์และการฝึกอบรมสร้างจิตสำนึกด้านสิ่งแวดล้อม
        งานวางแผนและจัดทำแผนดำเนินงานด้านการเฝ้าระวัง ควบคุมมลพิษทางน้ำ อากาศ และเสียง งานเฝ้าระวัง บำบัด ตรวจสอบคุณภาพน้ำ อากาศ ของเสียและสารอันตรายต่าง ๆ
        งานบริการข้อมูล สถิติ ช่วยเหลือให้คำแนะนำทางวิชาการ และงานอื่น ๆ ที่เกี่ยวข้องและที่ได้รับมอบหมาย มีผู้อำนวยการสาธารณสุขและสิ่งแวดล้อมควบคุมการปฏิบัติงาน ดังนี้
      </p>
    );
  };
  
  export default Description;
  